{
  "architectures": [
    "DeepseekV3ForCausalLM"
  ],
  "attention_bias": false,
  "bos_token_id": 250,
  "eos_token_id": 251,
  "first_k_dense_replace": 1,
  "hidden_size": 64,
  "intermediate_size": 128,
  "kv_lora_rank": 16,
  "max_position_embeddings": 4096,
  "model_type": "kimi_k2",
  "moe_intermediate_size": 16,
  "moe_layer_freq": 1,
  "n_group": 1,
  "n_routed_experts": 16,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 4,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 3,
  "num_key_value_heads": 4,
  "q_lora_rank": 32,
  "qk_nope_head_dim": 8,
  "qk_rope_head_dim": 8,
  "quantization_config": {
    "activation_scheme": "dynamic",
    "fmt": "e4m3",
    "quant_method": "fp8",
    "weight_block_size": [
      128,
      128
    ]
  },
  "rms_norm_eps": 1e-06,
  "rope_theta": 50000.0,
  "routed_scaling_factor": 2.827,
  "scoring_func": "sigmoid",
  "tie_word_embeddings": false,
  "topk_group": 1,
  "topk_method": "noaux_tc",
  "v_head_dim": 16,
  "vocab_size": 256
}
