{"transformers_version": "5.12.1", "architectures": ["DeepseekV3ForCausalLM"], "output_hidden_states": false, "return_dict": true, "dtype": "float32", "chunk_size_feed_forward": 0, "is_encoder_decoder": false, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "problem_type": null, "vocab_size": 256, "hidden_size": 128, "intermediate_size": 64, "moe_intermediate_size": 32, "num_hidden_layers": 4, "num_attention_heads": 4, "num_key_value_heads": 4, "n_shared_experts": 1, "n_routed_experts": 8, "routed_scaling_factor": 2.5, "kv_lora_rank": 32, "q_lora_rank": 64, "qk_rope_head_dim": 8, "v_head_dim": 32, "qk_nope_head_dim": 24, "n_group": 4, "topk_group": 2, "num_experts_per_tok": 2, "first_k_dense_replace": 2, "norm_topk_prob": true, "hidden_act": "silu", "max_position_embeddings": 4096, "initializer_range": 0.02, "rms_norm_eps": 1e-05, "use_cache": true, "pad_token_id": null, "bos_token_id": 0, "eos_token_id": 1, "pretraining_tp": 1, "tie_word_embeddings": false, "rope_parameters": {"rope_type": "default", "rope_theta": 10000.0}, "rope_interleave": true, "attention_bias": false, "attention_dropout": 0.0, "qk_head_dim": 32, "head_dim": 8, "_name_or_path": "", "model_type": "deepseek_v3", "output_attentions": false}